//#include<stdio.h>
//
//int main(){
//    int a = 23;
//    short aa = 10;
//    long ab = 40;
//    long long ac = 50;
//
//    float b = 0.1;
//    double c = 0.20;
//
//    char ff = 97;
//
//    printf("我今年%d岁\n",a);
//    printf("打印单精度数：%f\n",b);
//    printf("打印双精度数：%f\n",c);
//    printf("%c",ff);
//    字符串和字符不能直接赋值给变量
//
//
//题目：我的朋友叫做张三，性别男，他今年20岁，身高1米82，体重65公斤。要求输出出来时名字、年龄（多少米）、身高和体重要用占位符显示出来。
//    printf("我的朋友名字叫做%s，性别%s，他今年%d岁了，身高是%f米，体重%d公斤。","张三","男",20,1.83,65);
//
//题目：我的朋友叫做小丹丹，性别女，她今年19岁，身高1米53，体重42公斤。要求输出出来时名字、年龄（多少米）、身高和体重要每个为一行。
//    printf("我的朋友叫做%s\n","小丹丹");
//    printf("性别%s\n","女");
//    printf("她今年%d岁\n",19);
//    printf("身高%f米\n",1.53);
//    printf("体重%d公斤\n",42);
//
//
//    return 0;
//}
